### 타이타닉 데이터셋

In [127]:
import seaborn as sns

# titanic 데이터셋 가져오기
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
df.where(df.pclass == 1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,1.0,female,38.0,1.0,0.0,71.2833,C,First,woman,0.0,C,Cherbourg,yes,0.0
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.1000,S,First,woman,0.0,C,Southampton,yes,0.0
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,1.0,1.0,female,19.0,0.0,0.0,30.0000,S,First,woman,0.0,B,Southampton,yes,1.0
888,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,1.0,1.0,male,26.0,0.0,0.0,30.0000,C,First,man,1.0,C,Cherbourg,yes,1.0
890,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

* 누락 데이터 확인

In [ ]:
# deck 열의 빈도수 구하기(NaN 포함)

In [128]:
df.deck.value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
#deck 열의 NaN 개수 계산하기

In [16]:
df.deck.isnull().sum()

688

In [ ]:
# 전체 df의 누락 데이터 개수 구하기

In [30]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

* 누락 데이터 제거

In [ ]:
# 500개 이상 남아있지 않은 열을 모두 삭제

In [42]:
df.dropna(thresh=500, axis=1, inplace=True)

In [ ]:
# 삭제 되었는지 전체 컬럼 명 출력

In [43]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [10]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [ ]:
# age 열에 데이터가 없는 모든 행을 삭제 (subset 옵션 이용) dropna

In [57]:
df.dropna(subset=['age'], inplace=True)

In [ ]:
# 삭제 후 길이 확인

In [58]:
len(df)

714

In [14]:
dfff = df.dropna(subset=['age'])
len(dfff)

714

* 평균으로 누락 데이터 바꾸기

In [ ]:
# age 열의 첫 10개 데이터 출력 (5 행에 NaN 값 확인하기) mean값을 replace나 등등에 넣기

In [61]:
df.age.head(10)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: age, dtype: float64

In [ ]:
# age 열의 평균 계산

In [68]:
df.age.mean()

29.69911764705882

In [ ]:
# age 열의 NaN값을 위에서 구한 평균으로 변경하기, 원본에 적용하기

In [73]:
df.age.fillna(df.age.mean(), inplace=True)
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# age 열의 첫 10개 데이터 출력 (5 행에 NaN 값이 평균으로 대체된것 확인)

In [74]:
df.age.head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

* 가장 많이 나타나는 값으로 바꾸기

In [ ]:
# embark_town 열의 825행에서 829행까지 출력하기 (829행의 NaN값 확인) 카운트로 하면 순서대로 나오니까 뭐 그것도 맞는듯

In [76]:
df.embark_town[825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
# embark_town 열에 대해 빈도수 확인하기

In [79]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [ ]:
# embark_town 열에서 가장 많이 출현한 값(도시) 구하기

In [104]:
df.embark_town.value_counts().index[0]

'Southampton'

In [130]:
df.embark_town.value_counts().index[0]

'Southampton'

In [129]:
df.embark_town.value_counts().idxmax()

'Southampton'

In [132]:
df.embark_town.mode()[0]

'Southampton'

In [ ]:
# embark_town 열의 NaN값을 위에서 구한 값(가장 많이 출현한 값)으로 채우기, 원본에 적용하기

In [106]:
df.embark_town.fillna(df.embark_town.value_counts().index[0], inplace=True)
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# embark_town 열의 825행에서 829행까지 출력하기 (NaN 값이 가장 많이 출현한 값으로 대체된 것 확인)

In [107]:
df.embark_town[825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

* 이웃하고 있는 값으로 바꾸기

In [108]:
# titanic 데이터셋 가져오기
df = sns.load_dataset('titanic')

In [ ]:
# embark_town 열의 825행에서 829행까지 출력하기 (829행의 NaN값 확인)

In [109]:
df.embark_town[825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
# embark_town 열의 NaN값을 바로 앞에 있는 828행의 값으로 변경하기, 원본에 적용하기

In [117]:
df.fillna(method='ffill', inplace=True)

In [ ]:
# embark_town 열의 825행에서 829행까지 출력하기 (NaN 값이 바로 앞에 있는 값으로 대체된 것 확인)

In [118]:
df.embark_town[825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [25]:
#ffill

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

* 중복 데이터 확인

In [119]:
import pandas as pd

In [120]:
# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [ ]:
# 데이터프레임 전체 행 데이터 중에서 중복값 찾기

In [121]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
# 데이터프레임의 c2열 데이터에서 중복값 찾기

In [122]:
df.c2.duplicated()

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

* 중복 데이터 제거

In [123]:
# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [ ]:
# 데이터프레임에서 중복 행을 제거

In [124]:
df.drop_duplicates()

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [ ]:
# c2, c3열을 기준으로 중복 행을 제거

In [125]:
df.drop_duplicates(['c2', 'c3'])

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2